from enum import Enum


class template(Enum):

    # 换行符，该数组中的字符就换行
    wrap_character = ["。", "？", "！"]

    # 表示说话的词语,用于判断是否需要换行
    talk_str = ['：', '的说', '的道', "说道", "嘀咕", "笑骂", "怒骂", "骂道", "碎碎念", "大吼", "大叫", "笑道", "嘟囔", "揶揄",
                "问道", '呵斥', '边唱', '边说', '边讲', '叮嘱', '吩咐', '唠叨', '调侃', '讨论', '交流', '吩咐', '讲解', '七嘴八舌',
                '滔滔不绝', '口若悬河', '侃侃而谈', '念念有词', '振振有词', '喋喋不休', '娓娓道来', '支支吾吾']

    # 小说中的推广广告，类似"记住最新网址XXXXXXXXXXX之类的"
    # 以下2个数组，用用于在正则表达式中，匹配符合"开头的字符+结尾的字符"的所有内容，将其置为Null
    # 英文括号 记得加上反斜杠转义一下
    ad_str = [('\(天才只需一秒就能记住', 'com\)'), ('最新找回', 'ＣＯＭ'), ('【最新发布地址', '找到回家的路!】'), ('【发布地址', 'COM】'),
              ('【天才一秒就记住', '以备不时之需！】'), ('【发布地址', '速记(看其他)】'), ('【记住收藏地址', '以备不时之需！】'),
              ('【发布地址', 'com】'), ('【最新地址发布页', '收藏不迷路!】'), ('【回家的路', '收藏不迷路!】'), ('【最新发布页', '收藏不迷路!】'),
              ('【收藏不迷路', '以备不时之需】'), ('发布地址', '收藏不迷路！')]
